In [ ]:
#Ritesh Bhingare 
# Assignment no-02
# TY A 
# Roll no- 19

In [3]:
# importing libraries
import pandas as pd
# Creating the Series 
data =pd.Series([1,23,45,23,3,4,56,7],index=['a','b','c','d','e','f','g','h'])
# printing series
print(data)
print("\nAccessing the single value")
print(data['a'])

a     1
b    23
c    45
d    23
e     3
f     4
g    56
h     7
dtype: int64

Accessing the single value
1

In [4]:
#Arthimetric operation on Series
import pandas as pd
se=pd.Series([1,2,34,4,56,6,77,9,97,6,54,32])
# Multiply by 2
print("\nMultiply by 2\n :",se*2)
# Square
print("\nSquaring :\n",se**2)

Multiply by 2
 : 0       2
1       4
2      68
3       8
4     112
5      12
6     154
7      18
8     194
9      12
10    108
11     64
dtype: int64

Squaring :
 0        1
1        4
2     1156
3       16
4     3136
5       36
6     5929
7       81
8     9409
9       36
10    2916
11    1024
dtype: int64

In [ ]:
type(data)

pandas.core.series.Series

In [2]:
# Creating dataframe
import pandas as pd
data1={'Name':['yash','ram','sham','rahul','Saurabh','rohit'],
    'Age':[23,45,34,22,32,21],
    'City':['pune','mumbai','nagpur','nashik','ahmednagar','solapur']}
df=pd.DataFrame(data1)
print("Display Data using Dataframe")
print(df)
print("\nAccessing the single value")
print(df['Name'])
print("\nAccessing multiple values")
print(df[['Age','City']])

Display Data using Dataframe
      Name  Age        City
0     yash   23        pune
1      ram   45      mumbai
2     sham   34      nagpur
3    rahul   22      nashik
4  Saurabh   32  ahmednagar
5    rohit   21     solapur

Accessing the single value
0       yash
1        ram
2       sham
3      rahul
4    Saurabh
5      rohit
Name: Name, dtype: object

Accessing multiple values
   Age        City
0   23        pune
1   45      mumbai
2   34      nagpur
3   22      nashik
4   32  ahmednagar
5   21     solapur

In [5]:
# head 
df.head()

      Name  Age        City
0     yash   23        pune
1      ram   45      mumbai
2     sham   34      nagpur
3    rahul   22      nashik
4  Saurabh   32  ahmednagar

In [6]:
df.tail()

      Name  Age        City
1      ram   45      mumbai
2     sham   34      nagpur
3    rahul   22      nashik
4  Saurabh   32  ahmednagar
5    rohit   21     solapur

In [7]:
df.describe()

             Age
count   6.000000
mean   29.500000
std     9.354143
min    21.000000
25%    22.250000
50%    27.500000
75%    33.500000
max    45.000000

In [8]:
df.shape

(6, 3)

In [9]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [ ]:

df.index

RangeIndex(start=0, stop=6, step=1)

In [24]:
# Reading CSV file with actual data
import pandas as pd
data2=pd.read_csv('final_hotel.csv')
df1=pd.DataFrame(data2)
# checking the data
print("Display Data using Dataframe")
df1.head()

Display Data using Dataframe

,hotel name,rating,rating text,place,near by place,discount price,actual price,facilities,destination name,Unnamed: 9,Unnamed: 10
0,The Fern Sattva Resort - Polo Forest,4.3,Excellent,Abhapur,96.8 km from Ambaji city centre,3896,6449,Spa,Ambaji,NaN,NaN
1,Pride Resort Ambaji,3.8,Very Good,Ambaji,Not Available,2171,2875,Swimming Pool,Ambaji,NaN,NaN
2,Royal Inn Hotel,3.9,Very Good,Danta Road,Not Available,1356,2600,Restaurant,Ambaji,NaN,NaN
3,hotel leela residency,3.9,Very Good,Khodiyar Chowk,Not Available,1282,1500,Air Conditioning,Ambaji,NaN,NaN
4,HOTEL KARDHAR INN,4.2,Very Good,Khodiyar Chowk,Not Available,1563,3000,Butler Services,Ambaji,NaN,NaN

In [26]:
df1.tail()

,hotel name,rating,rating text,place,near by place,discount price,actual price,facilities,destination name,Unnamed: 9,Unnamed: 10
2360,Hotel Vardhan,3.1,Good,"Naroli Road, Silvassa",24.3 km from Valsad District,1281,1800,Restaurant,Valsad,NaN,NaN
2361,Hotel The Seven,3.0,Good,"Naroli Road, Silvassa",24.4 km from Valsad District,3169,7249,Gym,Valsad,NaN,NaN
2362,Yatri Niwas,3.8,Very Good,"Naroli Road, Silvassa",24.8 km from Valsad District,2786,3999,Restaurant,Valsad,NaN,NaN
2363,Hotel Suraj,3.5,Very Good,"Naroli Road, Silvassa",24.8 km from Valsad District,1753,2499,24-hour Room service,Valsad,NaN,NaN
2364,Ras Resorts by Treat,3.9,Very Good,"Naroli Road, Silvassa",25.2 km from Valsad District,7211,12199,Swimming Pool,Valsad,NaN,NaN

In [27]:
df1.describe()

            rating  discount price  actual price  Unnamed: 9  Unnamed: 10
count  2365.000000     2365.000000   2365.000000         0.0          0.0
mean      3.540761     2483.551797   3435.785201         NaN          NaN
std       0.613404     2595.499833   3330.495465         NaN          NaN
min       1.000000      305.000000    400.000000         NaN          NaN
25%       3.300000     1242.000000   1800.000000         NaN          NaN
50%       3.500000     1733.000000   2519.000000         NaN          NaN
75%       3.900000     2721.000000   4000.000000         NaN          NaN
max       5.000000    45000.000000  50000.000000         NaN          NaN

In [28]:
df1.columns

Index(['hotel name', 'rating', 'rating text', 'place', 'near by place',
       'discount price', 'actual price', 'facilities', 'destination name',
       'Unnamed: 9', 'Unnamed: 10'],
      dtype='object')

In [ ]:
df1

In [38]:
# Maximum and minimum rating
print("Highest rating:",df1['rating'].max())      # Highest rating
print(df1['rating'].min())      # Lowest rating

# Actual price statistics
print(df1['actual price'].mean())    # Average price (use mean(), not avg())
print(df1['actual price'].median())  # Median price
print(df1['actual price'].max())     # Maximum actual price

# Discount price statistics
print(df1['discount price'].max())   # Maximum discount price
print(df1['discount price'].min())   # Minimum discount price
print(df1['discount price'].std())   # Standard deviation of discount price

Highest rating: 5.0
1.0
3435.785200845666
2519.0
50000
45000
305
2595.4998332647842